<?php

// Дан массив из n элементов, начиная с 1. Каждый следующий элемент равен (предыдущий + 1). 
// Но в массиве гарантированно 1 число пропущено. Необходимо вывести на экран пропущенное число.

// Примеры:
// [1, 2 ,3, 4, 5, 6, 7, 8, 9, 10, 12, 13, 14, 15, 16] => 11
// [1, 2, 4, 5, 6] => 3
// [] => 1

function f($arr) {
    $length = count($arr);

    if ($length == 0) {
        return 1;
    }
    
    if ($length > 1) {
        $arr = array_chunk($arr, ceil($length / 2));

        if (end($arr[0]) + 1 != reset($arr[1])) {
            return end($arr[0]) + 1;
        } elseif ($res = f($arr[0])) {
            return $res;
        } elseif ($res = f($arr[1])) {
            return $res;
        }
    }
}

// echo f([]);
// echo f([1, 2, 4, 5, 6]);
// echo f([1, 2 ,3, 4, 5, 6, 7, 8, 9, 10, 12, 13, 14, 15, 16]);
